import path from "path";
import { defineConfig } from "vitepress";
const { generateSidebar } = require("./theme/util/sidebarGenerator"); // 基于文件目录生成 sidebar

export default defineConfig({
	lang: "zh-CN", // 语言
	title: "前端工程师博客", // 网站标题
	description: "Vite 和 Vue 支持的静态站点生成器", // 描述
	titleTemplate: "Vite & Vue powered static site generator", // 标题的后缀
	base: "/Blog/", // GitHub部署配置
	cleanUrls: true, // 清洁网址
	ignoreDeadLinks: true, // 忽略死链接
	appearance: true, // 是否开启深色模式
	lastUpdated: true, // 最近更新时间
	outDir: "../dist", // 输出目录
	cacheDir: "./.vitepress/cache", // 缓存目录
	srcDir: "./", // 源目录
	head: [
		// head标签
		["link", { rel: "icon", href: "/Blog/avatar.ico" }],
		[
			"link",
			{
				rel: "apple-touch-icon-precomposed",
				href: "/Blog/logo.png",
				type: "image/png",
			},
		],
	],
	vite: {
		resolve: {
			alias: {
				"@": path.resolve(__dirname, "theme"),
			},
		},
	},
	vue: {
		// @vitejs/plugin-vue options
	},
	// rewrites: { // URL 映射
	//   'source/:page': 'destination/:page'
	// },
	async buildEnd(siteConfig) {
		// 构建结束
		// ...
	},
	async postRender(context) {
		// 渲染后
		// ...
	},
	async transformHead(context) {
		// 变形头
		// ...
	},
	async transformHtml(code, id, context) {
		// 转换HTML
		// ...
	},
	async transformPageData(pageData) {
		// 转换页面数据
		// ...
	},
	markdown: {
		// 配置 Markdown 解析器选项
		theme: "material-theme-palenight",
		lineNumbers: true,
		anchors: {
			slugify(str) {
				return encodeURIComponent(str);
			},
		},
	},
	themeConfig: {
		logo: "/avatar.png", // 头像
		siteTitle: "贾志恒", // 站点标题
		// 导航栏
		nav: [
			{
				text: "文章",
				items: [
					{
						text: "HTML",
						link: "/guide/article/html/test_article",
					},
					{
						text: "CSS",
						link: "/guide/article/css/test_article",
					},
				],
			},
			{
				text: "项目",
				link: "/guide/project/project",
			},
			{ text: "资料", link: "/guide/material/regularExpression" },
		],
		// 侧边栏
		// sidebar: sidebar,
		sidebar: {
			"/guide/article/": generateSidebar(
				"./docs/guide/article/",
				"/guide/article/"
			),
			// 项目
			"/guide/project/": [
				{
					text: "项目",
					items: [
						{
							text: "项目",
							link: "/guide/project/project",
						},
					],
				},
			],
			// 资料
			"/guide/material/": [
				{
					text: "正则表达式",
					items: [
						{
							text: "正则表达式",
							link: "/guide/material/regularExpression",
						},
					],
				},
				{
					text: "Linux",
					items: [
						{
							text: "Linux",
							link: "/guide/material/Linux",
						},
					],
				},
			],
		},
		// sidebar: {
		// 	// 工作
		// 	"/guide/work/": [
		// 		{
		// 			text: "工作中遇到的问题和对应解决方案",
		// 			items: [
		// 				{
		// 					text: "MP3 转 M4A 的动画效果",
		// 					link: "/guide/work/a",
		// 				},
		// 				{
		// 					text: "揭开优惠券的动画效果",
		// 					link: "/guide/work/b",
		// 				},
		// 				{
		// 					text: "揭开优惠券的动画效果(第二种)",
		// 					link: "/guide/work/c",
		// 				},
		// 				{
		// 					text: "回到顶部的方法",
		// 					link: "/guide/work/d",
		// 				},
		// 				{
		// 					text: "涟漪效果",
		// 					link: "/guide/work/e",
		// 				},
		// 				{
		// 					text: "翻转效果",
		// 					link: "/guide/work/f",
		// 				},
		// 				{
		// 					text: "带进度条的音乐播放器",
		// 					link: "/guide/work/g",
		// 				},
		// 				{
		// 					text: "简易音乐播放器",
		// 					link: "/guide/work/h",
		// 				},
		// 				{
		// 					text: "英文邮件(邮件必须用行内样式)",
		// 					link: "/guide/work/i",
		// 				},
		// 				{
		// 					text: "日文邮件(邮件必须用行内样式)",
		// 					link: "/guide/work/j",
		// 				},
		// 				{
		// 					text: "使用 webp 格式的图片优化加载速度",
		// 					link: "/guide/work/k",
		// 				},
		// 				{
		// 					text: "好看的 hover 样式",
		// 					link: "/guide/work/l",
		// 				},
		// 				{
		// 					text: "实现打印功能",
		// 					link: "/guide/work/m",
		// 				},
		// 				{
		// 					text: "测试在 html 中引入 pdf 文件",
		// 					link: "/guide/work/n",
		// 				},
		// 			],
		// 		},
		// 	],
		// }
		/* 社交链接 */
		socialLinks: [
			{ icon: "github", link: "https://github.com/JiaZhiheng" },
			// {
			// 	icon: "linkedin",
			// 	link: "https://github.com/JiaZhiheng",
			// },
			// {
			// 	icon: {
			// 		svg: '<svg t="1683367882818" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="945" width="128" height="128"><path d="M891.62334815 634.81931852c-19.41807408-62.38056297-41.74885925-114.80936297-76.09457778-200.61297777C820.86874075 208.83531852 727.17653333 26.54814815 511.39318518 26.54814815 293.18257778 26.54814815 201.55354075 212.47620741 207.37896297 434.20634075c-34.46708148 85.92497778-56.6765037 137.98968889-76.09457779 200.61297777-41.26340741 132.89244445-27.91348148 187.86986667-17.71899259 189.0834963 21.84533333 2.66998518 85.07543703-100.00308148 85.07543704-100.00308149 0 59.46785185 30.58346667 137.01878518 96.84764445 192.96711112-32.03982222 9.8304-104.00805925 36.28752592-86.89588149 65.29327407 13.83537778 23.42305185 238.11413333 14.92764445 302.80059259 7.64586666 64.68645925 7.28177778 288.96521482 15.77718518 302.8005926-7.64586666 17.11217778-28.88438518-54.97742222-55.46287408-86.89588148-65.29327407 66.26417778-56.06968889 96.84764445-133.62062222 96.84764445-192.96711112 0 0 63.2301037 102.67306667 85.07543703 100.00308149 10.31585185-1.33499259 23.66577778-56.31241482-17.59762963-189.0834963z" p-id="946"></path></svg>',
			// 	},
			// 	link: "https://github.com/JiaZhiheng",
			// },

			// {
			// 	icon: {
			// 		svg: '<svg t="1683368100092" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="975" width="128" height="128"><path d="M714.63822222 358.85511111c6.71288889 0 13.42577778 0.22755555 20.02488889 0.56888889-27.76177778-146.432-180.11022222-258.38933333-363.97511111-258.38933333C167.25333333 101.03466667 2.27555555 238.25066667 2.27555555 407.552c0 92.27377778 49.60711111 175.44533333 127.31733334 231.65155555 6.25777778 4.43733333 10.35377778 11.71911111 10.35377778 20.0248889 0 2.73066667-0.56888889 5.23377778-1.25155556 7.85066666-6.25777778 23.09688889-16.15644445 60.07466667-16.61155556 61.78133334-0.79644445 2.95822222-1.93422222 5.91644445-1.93422222 8.98844444 0 6.71288889 5.46133333 12.288 12.288 12.288 2.61688889 0 4.77866667-1.024 7.05422222-2.27555556l80.66844445-46.53511111c6.03022222-3.52711111 12.51555555-5.68888889 19.56977778-5.68888889 3.64088889 0 7.28177778 0.56888889 10.80888889 1.59288889 37.66044445 10.80888889 78.27911111 16.83911111 120.26311111 16.83911111 6.82666667 0 13.53955555-0.11377778 20.25244444-0.45511111-8.07822222-23.89333333-12.40177778-49.03822222-12.40177777-75.09333333 0-154.51022222 150.41422222-279.66577778 335.98577777-279.66577778z m-221.07022222-98.41777778c27.07911111 0 49.152 21.95911111 49.152 49.03822222s-21.95911111 49.03822222-49.152 49.03822223c-27.07911111 0-49.152-21.95911111-49.152-49.03822223s22.07288889-49.03822222 49.152-49.03822222z m-245.64622222 98.07644445c-27.07911111 0-49.152-21.95911111-49.152-49.03822223s21.95911111-49.03822222 49.152-49.03822222 49.152 21.95911111 49.152 49.03822222-22.07288889 49.03822222-49.152 49.03822223z" p-id="976"></path><path d="M915.56977778 831.37422222c64.73955555-46.87644445 106.04088889-116.05333333 106.04088889-193.08088889 0-141.08444445-137.44355555-255.43111111-307.08622222-255.43111111-169.52888889 0-307.08622222 114.34666667-307.08622223 255.43111111S544.88177778 893.72444445 714.52444445 893.72444445c35.04355555 0 68.94933333-5.00622222 100.23822222-13.99466667 2.95822222-0.91022222 5.91644445-1.36533333 8.98844444-1.36533333 5.91644445 0 11.264 1.82044445 16.27022222 4.66488888l67.24266667 38.68444445c1.93422222 1.13777778 3.75466667 1.93422222 5.91644445 1.93422222 2.73066667 0 5.34755555-1.024 7.28177777-2.95822222 1.93422222-1.93422222 2.95822222-4.55111111 2.95822223-7.28177778 0-2.50311111-1.024-5.00622222-1.5928889-7.50933333-0.34133333-1.36533333-8.64711111-32.19911111-13.88088888-51.54133334-0.56888889-2.16177778-1.024-4.32355555-1.024-6.48533333 0.11377778-6.71288889 3.52711111-12.74311111 8.64711111-16.49777778zM612.352 597.56088889c-22.64177778 0-40.96-18.31822222-40.96-40.84622222 0-22.528 18.31822222-40.84622222 40.96-40.84622222s40.96 18.31822222 40.96 40.84622222c0 22.528-18.432 40.84622222-40.96 40.84622222z m204.68622222 0c-22.64177778 0-40.96-18.31822222-40.96-40.84622222 0-22.528 18.31822222-40.84622222 40.96-40.84622222s40.96 18.31822222 40.96 40.84622222c-0.11377778 22.528-18.432 40.84622222-40.96 40.84622222z" p-id="977"></path></svg>',
			// 	},
			// 	link: "https://github.com/JiaZhiheng",
			// },
			// {
			// 	icon: {
			// 		svg: '<svg t="1683368538382" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1064" width="128" height="128"><path d="M1024 315.178667v447.061333a32.853333 32.853333 0 0 1-10.154667 24.576 34.133333 34.133333 0 0 1-24.746666 9.813333h-364.672v-296.917333l68.266666 52.437333a24.405333 24.405333 0 0 0 16.170667 5.376 26.368 26.368 0 0 0 16.597333-5.418666L1024 315.178667z m-399.573333-86.229334h364.672c9.002667 0 16.768 2.688 23.168 8.192 6.4 5.461333 9.984 12.8 10.581333 21.76l-314.410667 250.709334-84.010666-66.090667V228.949333zM571.904 36.864v950.229333L0 888.277333V138.410667L571.989333 36.864h-0.085333z m-172.757333 477.013333c-0.853333-48.341333-13.354667-88.405333-37.504-120.064-23.68-31.573333-54.4-48.256-90.922667-49.664-35.157333 1.408-65.237333 18.048-89.6 49.664-24.32 31.658667-36.48 71.765333-37.12 120.064 0.64 47.658667 13.44 87.338667 37.76 119.082667 24.362667 31.573333 54.357333 48.341333 89.642667 50.176 36.48-1.493333 67.157333-18.090667 91.52-49.92 24.32-31.914667 37.12-71.68 37.76-119.338667h-1.536z m-133.12-105.898666c18.389333 0.853333 33.877333 10.922667 46.208 30.592 12.16 19.669333 18.56 44.586667 18.56 74.752 0 30.762667-6.357333 55.765333-18.56 75.562666-12.842667 19.797333-28.16 30.037333-46.762667 30.037334s-33.92-9.642667-46.72-29.44-18.56-44.8-18.56-74.837334c0-30.08 5.76-55.082667 18.56-74.24 12.117333-19.2 27.562667-29.44 46.122667-30.762666l1.152-1.664z" p-id="1065"></path></svg>',
			// 	},
			// 	link: "https://github.com/JiaZhiheng",
			// },
			// {
			// 	icon: {
			// 		svg: '<svg t="1683368403911" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="915" width="128" height="128"><path d="M983.5817984 334.10270094V817.14116381a83.2203173 83.2203173 0 0 1-83.2203173 83.22031729H123.6385189a83.2203173 83.2203173 0 0 1-83.2203173-83.22031729V334.10270094l346.00233984 293.3516197a194.18074112 194.18074112 0 0 0 251.15891712 0L983.5817984 334.10270094zM900.3614811 123.6385189a84.24670094 84.24670094 0 0 1 29.68191317 5.43705998 82.72099555 82.72099555 0 0 1 34.84157384 25.24349667 83.63641856 83.63641856 0 0 1 12.15016618 20.11157618c3.60621397 8.54395221 5.82542222 17.80914745 6.38022429 27.54592541L983.5817984 206.85883619v27.74010539L566.00998571 590.7819008a83.2203173 83.2203173 0 0 1-103.88669554 3.30107221l-4.13327588-3.32881237L40.4182016 234.59894158v-27.74010539a82.94291683 82.94291683 0 0 1 45.68795363-74.28800398A83.02613618 83.02613618 0 0 1 123.6385189 123.6385189h776.7229622z" p-id="916"></path></svg>',
			// 	},
			// 	link: "https://github.com/JiaZhiheng",
			// },
		],
		/* 文档页脚 */
		docFooter: {
			prev: "上一篇",
			next: "下一篇",
		},
		// footer: {
		// 	// 页脚
		// 	message: "Released under the MIT License.",
		// 	copyright: "Copyright © 2019-present Evan You",
		// },
		lastUpdated: true,
		aside: true,
		outline: 2,
		outlineBadges: true,
		outlineTitle: "大纲", // 大纲标题
		lastUpdatedText: "Updated Date", // 最后更新文本
		editLink: {
			pattern: "https://github.com/vuejs/vitepress/edit/main/docs/:path",
			text: "Edit this page on GitHub",
		},
		// carbonAds: {
		// 	// 广告
		// 	code: "your-carbon-code",
		// 	placement: "your-carbon-placement",
		// },
		algolia: {
			appId: "80GWMAOJY7",
			apiKey: "38a0f8063ac54c4d32636029c465e6ad",
			indexName: "jiazhihengio",
			locales: {
				zh: {
					placeholder: "搜索文档",
					translations: {
						button: {
							buttonText: "搜索文档",
							buttonAriaLabel: "搜索文档",
						},
						modal: {
							searchBox: {
								resetButtonTitle: "清除查询条件",
								resetButtonAriaLabel: "清除查询条件",
								cancelButtonText: "取消",
								cancelButtonAriaLabel: "取消",
							},
							startScreen: {
								recentSearchesTitle: "搜索历史",
								noRecentSearchesText: "没有搜索历史",
								saveRecentSearchButtonTitle: "保存至搜索历史",
								removeRecentSearchButtonTitle: "从搜索历史中移除",
								favoriteSearchesTitle: "收藏",
								removeFavoriteSearchButtonTitle: "从收藏中移除",
							},
							errorScreen: {
								titleText: "无法获取结果",
								helpText: "你可能需要检查你的网络连接",
							},
							footer: {
								selectText: "选择",
								navigateText: "切换",
								closeText: "关闭",
								searchByText: "搜索提供者",
							},
							noResultsScreen: {
								noResultsText: "无法找到相关结果",
								suggestedQueryText: "你可以尝试查询",
								reportMissingResultsText: "你认为该查询应该有结果？",
								reportMissingResultsLinkText: "点击反馈",
							},
						},
					},
				},
			},
		},
		darkModeSwitchLabel: "Appearance",
		sidebarMenuLabel: "Menu",
		returnToTopLabel: "Return to top",
	},
});
